CREATE DATABASE airflow_db;

CREATE TABLE IF NOT EXISTS sales (
    id           SERIAL PRIMARY KEY,
    product_name VARCHAR(100)   NOT NULL,
    category     VARCHAR(50)    NOT NULL,
    quantity     INTEGER        NOT NULL,
    price        DECIMAL(10, 2) NOT NULL,
    sale_date    DATE           NOT NULL,
    region       VARCHAR(50)    NOT NULL
);

INSERT INTO sales (product_name, category, quantity, price, sale_date, region) VALUES
('Ноутбук Pro 15',      'Электроника', 5,  89999.00, '2024-01-15', 'Москва'),
('Смартфон X12',        'Электроника', 12, 59999.00, '2024-01-16', 'Санкт-Петербург'),
('Офисное кресло',      'Мебель',      8,  15000.00, '2024-01-17', 'Москва'),
('Стол-трансформер',    'Мебель',      3,  35000.00, '2024-01-18', 'Казань'),
('Беспроводная мышь',   'Электроника', 25, 2500.00,  '2024-01-19', 'Москва'),
('Механ. клавиатура',   'Электроника', 15, 8500.00,  '2024-01-20', 'Санкт-Петербург'),
('Монитор 27"',         'Электроника', 7,  42000.00, '2024-01-21', 'Москва'),
('Книжный шкаф',        'Мебель',      4,  12000.00, '2024-01-22', 'Новосибирск'),
('Веб-камера HD',       'Электроника', 18, 5500.00,  '2024-01-23', 'Москва'),
('Настольная лампа',    'Мебель',      30, 3200.00,  '2024-01-24', 'Екатеринбург'),
('USB-хаб 7 портов',    'Электроника', 40, 1800.00,  '2024-01-25', 'Москва'),
('Игровое кресло',      'Мебель',      6,  28000.00, '2024-01-26', 'Санкт-Петербург'),
('Наушники BT',         'Электроника', 10, 12000.00, '2024-01-27', 'Казань'),
('Тумба для документов','Мебель',      2,  18000.00, '2024-01-28', 'Москва'),
('Внешний SSD 1TB',     'Электроника', 9,  7500.00,  '2024-01-29', 'Новосибирск'),
('Принтер лазерный',    'Электроника', 4,  22000.00, '2024-01-30', 'Екатеринбург'),
('Пуфик',               'Мебель',      11, 6500.00,  '2024-01-31', 'Казань'),
('Сканер A4',           'Электроника', 3,  14000.00, '2024-02-01', 'Москва'),
('Стеллаж металл.',     'Мебель',      7,  9800.00,  '2024-02-02', 'Новосибирск'),
('Планшет 10"',         'Электроника', 14, 34000.00, '2024-02-03', 'Санкт-Петербург');
